In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import sqlite3
conn = sqlite3.connect('database.sqlite')
c = conn.cursor()
# Country Data COUNTRY table
COUNTRY_df = pd.read_sql_query("select * from COUNTRY;", conn)
# League data from LEAGUE
LEAGUE_df = pd.read_sql_query("select * from LEAGUE;", conn)
# Match data from Matches - just pulling 1 year for now -2015/2016 might be latest year
# You can remove restriction if you want
MATCH_df = pd.read_sql_query("select * from MATCH where SEASON = '2015/2016';", conn)
# Match data from Matches - just pulling 1 and relevant data for now - we can remove restriction later if we want
MATCH_cutdown_df = pd.read_sql_query("SELECT SEASON, STAGE, DATE, MATCH_API_ID, HOME_TEAM_API_ID, AWAY_TEAM_API_ID, HOME_TEAM_GOAL, AWAY_TEAM_GOAL FROM MATCH WHERE SEASON = '2015/2016';",
conn)

In [3]:
MATCH_cutdown_df.head()

,season,stage,date,match_api_id,home_team_api_id,away_team_api_id,home_team_goal,away_team_goal
0,2015/2016,1,2015-07-24 00:00:00,1979832,9997,8342,2,1
1,2015/2016,1,2015-07-25 00:00:00,1979833,8571,9985,2,1
2,2015/2016,1,2015-07-25 00:00:00,1979834,9987,1773,3,1
3,2015/2016,1,2015-07-25 00:00:00,1979835,8573,8203,3,1
4,2015/2016,1,2015-07-25 00:00:00,1979836,10000,9994,3,1

In [4]:
LEAGUE_df.head()

      id  country_id                    name
0      1           1  Belgium Jupiler League
1   1729        1729  England Premier League
2   4769        4769          France Ligue 1
3   7809        7809   Germany 1. Bundesliga
4  10257       10257           Italy Serie A